multiSpeciesMassTransportLibrary/testCases/modifiedReactingFoam_pure_diff/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// A.Alexiou 2015
//thermoType hsPsiMixtureThermo<reactingMixture<gasThermoPhysics>>;
//thermoType hePsiThermo<reactingMixture<const<hConst<perfectGas<specie>>,sensibleInternalEnergy>>>
thermoType
{
	type hePsiThermo;
	mixture reactingMixture;
	transport const; // sutherland;
	thermo hConst; // janaf;
	energy sensibleEnthalpy;
	equationOfState perfectGas;
	specie specie;
}

inertSpecie N2;

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/reactions";

foamChemistryThermoFile "$FOAM_CASE/constant/thermo.compressibleGas";


// ************************************************************************* //
